Repository: aurowallet/auro-wallet-mobile-app
Catalog: lib/l10n/app_*.arb
Languages: ru, uk, zh

# backup_success_restore
source: Congrats, You have successfully restored a wallet!
ru: Поздравляем, вы успешно восстановили кошелек!
uk: Вітаємо, ви успішно відновили гаманець!
zh: 恭喜您，已经成功导入钱包！

source: Confirm
ru: Подтвердить
uk: Підтвердити
zh: 确定

source: Wallet
ru: Кошелёк
uk: Гаманець
zh: 钱包

source: Staking
ru: Стейкинг
uk: Ставка
zh: 委托

# setting
source: Settings
ru: Настройки
uk: Налаштування
zh: 设置

# stakingStatus_2
source: Undelegated
ru: Не делегировано
uk: Неделегований
zh: 未委托

source: Send
ru: Отправить
uk: Надіслати
zh: 发送

# toAddress
source: To
ru: Кому
uk: до
zh: 接收

source: Fee
ru: Комиссия
uk: Комісія
zh: 交易费

# fee_default
source: Default
ru: По умолчанию
uk: Стандартно
zh: 默认

# advanceMode
source: Advanced
ru: Расширенный
uk: Просунутий
zh: 高级

# sendAddressError
source: Please enter a valid wallet address
ru: Пожалуйста, введите корректный адрес кошелька
uk: Введіть дійсну адресу гаманця
zh: 请输入有效地址

# goToExplrer
source: Query Details
ru: Детали запроса
uk: Деталі запиту
zh: 查看详情

source: Details
ru: Детали
uk: Подробиці
zh: 详情

source: Wallet Address
ru: Адрес кошелька
uk: Адреса гаманця
zh: 钱包地址

source: Create
ru: Создать
uk: Створити
zh: 创建

# accountManage
source: Account Management
ru: Управление счётами
uk: Управління рахунками
zh: 账户管理

# inputAccountName
source: Please enter your account name
ru: Пожалуйста, введите имя вашего счета
uk: Введіть назву свого облікового запису
zh: 请输入您的账户名称

# importAccount_3
source: The imported accounts will be marked with [Imported] in the account list.
ru: Импортированные счета будут отмечены в списке счетов символом [Импортировано].
uk: Імпортовані облікові записи будуть позначені [Імпортовані] у списку облікових записів.
zh: 导入的账户在账户列表页有【导入】标识。

# accountInfo
source: Account Details
ru: Детали счета
uk: Реквізити облікового запису
zh: 账户信息

# accountDelete
source: Delete Account
ru: Удалить счёт
uk: Видалити аккаунт
zh: 删除账户

source: Cancel
ru: Отмена
uk: Скасувати
zh: 取消

# privateKeyTip_2
source: Once the private key is lost, it cannot be retrieved. Please make sure to backup the private key and keep it in a safe place.
ru: После потери закрытого ключа его невозможно восстановить. Пожалуйста, сделайте резервную копию приватного ключа и храните его в безопасном месте.
uk: Після втрати закритого ключа його неможливо відновити. Обов’язково створіть резервну копію закритого ключа та зберігайте його в безпечному місці.
zh: 私钥丢失，无法找回，请务必备份好私钥，并将其保管至安全的地方。

source: Security
ru: Безопасность
uk: Безпека
zh: 安全

source: Network
ru: Сеть
uk: Мережа
zh: 网络

source: Language
ru: Язык
uk: Мова
zh: 语言

source: Currency
ru: Валюта
uk: Валюта
zh: 法币类型

source: About
ru: О проекте
uk: про
zh: 关于我们

# restoreSeed
source: Backup Mnemonic Phrase
ru: Резервная копия мнемонической фразы
uk: Резервна мнемонічна фраза
zh: 备份助记词

source: Change Password
ru: Изменить пароль
uk: Змінити пароль
zh: 更改密码

# pwdChangeSuccess
source: Password changed
ru: Пароль изменен
uk: Пароль змінено
zh: 密码修改成功

source: Delete
ru: Удалить
uk: Видалити
zh: 删除

# urlError_1
source: Invalid node URL
ru: Недопустимый URL-адрес узла
uk: Недійсна URL-адреса вузла
zh: 无效的节点地址

# urlError_2
source: Address already exists
ru: Адрес уже существует
uk: Адреса вже існує
zh: 地址已存在

# urlError_3
source: Node address already exists
ru: Адрес узла уже существует
uk: Адреса вузла вже існує
zh: 节点地址已存在

# prompt
source: Reminder
ru: Напоминание
uk: Нагадування
zh: 提示

# privateError
source: Private Key Incorrect
ru: Неверный приватный ключ
uk: Приватний ключ неправильний
zh: 私钥错误

# confirmDeleteNode
source: Are you sure to delete it?
ru: Вы уверены, что хотите удалите его?
uk: Ви впевнені, що хочете його видалити?
zh: 确认删除？

# backupSuccess
source: Success
ru: Успех
uk: Успіх
zh: 成功

# copyConfirm
source: Copy Anyway
ru: Копировать в любом случае
uk: Все одно копіювати
zh: 仍要复制

# copyCancel
source: Stop Copying
ru: Прекратить копирование
uk: Зупинити копіювання
zh: 不再复制

# scantopay
source: Scan to pay me
ru: Сканировать, чтобы заплатить мне
uk: Скануйте, щоб заплатити мені
zh: 扫码支付

# addressQrTip
source: Scan the QR code and transfer <strongBlack>{symbol}</strongBlack> to it
ru: Отсканируйте QR-код и переведите на него MINA
uk: Відскануйте QR-код і перенесіть на нього <strongBlack>{symbol}</strongBlack>
zh: 扫描二维码，转入 <strongBlack>{symbol}</strongBlack>

# homeNoTx
source: Unknown node, unable to provide history.
ru: Неизвестный узел, не способный предоставить историю.
uk: Невідомий вузол, неможливо надати історію.
zh: 未知类型节点，无法提供相关记录。

source: Delegation Info
ru: Делегировании
uk: Делегування
zh: 委托信息

source: Private Key
ru: Приватный ключ
uk: Приватний ключ
zh: 私钥

source: APPLIED
ru: ПРИМЕНЕНО
uk: ПРИКЛАДНА
zh: 完成

source: PENDING
ru: В ОЖИДАНИИ
uk: В ОЧІКУВАННІ
zh: 等待

source: Block Producer Name
ru: Имя производителя блоков
uk: Назва виробника блоку
zh: 出块节点名称

# producerName
source: Block Producer Name
ru: Имя производителя блоков
uk: Назва Виробник блоків
zh: 出块节点名称

source: Block Producer Address
ru: Адрес валидатора
uk: Адреса виробника блоків
zh: 出块节点地址

# notValidAddress
source: Not valid MINA address
ru: Не действительный MINA адрес
uk: Недійсна адреса MINA
zh: 无效的 MINA 地址

# userAgree
source: Terms and Conditions
ru: Условия
uk: Правила та умови
zh: 使用条款

source: Imported
ru: Импортировано
uk: Імпортовано
zh: 导入

# textWatchModeAddress
source: Enter or paste wallet address
ru: Введите или вставьте адрес кошелька
uk: Введіть або вставте адресу гаманця
zh: 输入或粘贴钱包地址

# timeout
source: Request Timeout
ru: Истекло время ожидания
uk: Час очікування запиту минув
zh: 请求超时

# exitConfirm
source: Do you want to exit the App?
ru: Вы хотите выйти из приложения?
uk: Ви хочете вийти з програми?
zh: 确定要退出 App 吗？

# unlockBioEnable
source: Biometric Authentication
ru: Биометрическая аутентификация
uk: Біометрична автентифікація
zh: 生物识别

# unlockBio
source: Authenticate to unlock
ru: Пройдите аутентификацию для разблокировки
uk: Щоб розблокувати, пройдіть автентифікацію
zh: 验证以解锁

# feeTooLarge
source: Fees are much higher than average
ru: Комиссия намного выше средней
uk: Комісії значно вищі за середні
zh: 交易费用远高于平均值

source: Add
ru: Добавить
uk: додати
zh: 添加

source: Address Book
ru: Адресная книга
uk: Адресна книга
zh: 地址簿

source: Refuse
ru: Отклонить
uk: Відмовитися
zh: 拒绝

# termsDialogTitle
source: Terms and Privacy Policy
ru: Условия и политика конфиденциальности
uk: Умови та політика конфіденційності
zh: 使用条款及隐私政策

source: Scan
ru: Сканировать
uk: Сканувати
zh: 扫描

# restoreTip
source: If you want to import private key/keystore or connect Ledger, need to [Create Wallet] or [Restore Wallet] first.
ru: Если вы хотите импортировать приватный ключ/keystore или подключить Ledger, сначала нужно [Создать кошелек] или [Восстановить кошелек].
uk: Якщо ви хочете імпортувати приватний ключ/сховище ключів або підключити Ledger, спочатку потрібно [Створити гаманець] або [Відновити гаманець].
zh: 提示: 若要导入私钥匙 / Keystore 或连接 Ledger，需先[创建钱包]或者[恢复钱包]。

# confirmReset
source: Reset
ru: Сброс
uk: Скинути
zh: 重置

source: Save
ru: Сохранить
uk: зберегти
zh: 保存

# deleteWatch
source: Delete watch account
ru: Удалить наблюдаемый аккаунт
uk: Видалити обліковий запис годинника
zh: 删除观察钱包

source: Edit
ru: Изменить
uk: Редагувати
zh: 编辑

# allTransfer
source: Max
ru: Максимум
uk: Макс
zh: 全部

# noMoreSupported
source: No longer supported account
ru: Больше не поддерживается счет
uk: Обліковий запис більше не підтримується
zh: 不再支持的账户

source: Password
ru: Пароль
uk: Пароль
zh: 密码

# confirmPasswordShort
source: Confirm Password
ru: Подтвердить пароль
uk: Підтвердьте пароль
zh: 确认密码

source: Share
ru: Поделиться
uk: Поділіться
zh: 分享

source: Copy
ru: Копировать
uk: Копія
zh: 复制

source: Speed Up
ru: Ускорить
uk: Прискоритись
zh: 加速

# stakedBalance
source: Staked
ru: Застейкано
uk: Ставили
zh: 已委托

source: Testnet
ru: Тестнет
uk: Тест
zh: 测试网

source: My Wallet
ru: Мой кошелёк
uk: Мій гаманець
zh: 我的钱包

# accountNameLimit
source: No more than 16 characters
ru: Не более 16 символов
uk: Не більше 16 символів
zh: 不超过16个字符

# github
source: Check it out on Github
ru: Проверьте на Github
uk: Подивіться на Github
zh: 查看 Github

source: No Address
ru: Нет Адреса
uk: Немає адреси
zh: 没有地址

source: Edit Address
ru: Изменить адрес
uk: Редагувати адресу
zh: 编辑地址

# nodeAlert
source: Only add custom nodes you trust. Using unknown nodes can be risky.
ru: Добавьте только пользовательские узлы, которым вы доверяете. Использование неизвестных узлов может быть рискованным.
uk: Додавайте лише спеціальні вузли, яким довіряєте. Використання невідомих вузлів може бути ризикованим.
zh: 请务必只添加受您信任的节点。使用未知节点会有一定风险。

# invalidContact
source: Invalid address
ru: Неверный адрес
uk: Недійсна адреса
zh: 地址格式错误

# ledgerTip3
source: Select a hardware wallet you‘d like to use with Auro Wallet.
ru: Выберите аппаратный кошелек, который вы хотите использовать с Auro Wallet.
uk: Виберіть апаратний гаманець, який ви хочете використовувати з Auro Wallet.
zh: 选择您想要使用的硬件钱包。

source: Connect Hardware Wallet
ru: Подключить аппаратный кошелек
uk: Підключіть апаратний гаманець
zh: 连接硬件钱包

source: Select HD Path
ru: Выберите путь HD
uk: Виберіть HD шлях
zh: 选择 HD 派生路径

# ledgerReject
source: Rejected by Ledger
ru: Отклонено Ledger-ом
uk: Відхилено Ledger
zh: Ledger 已拒绝

source: Contribute Language
ru: Добавить язык
uk: Додайте мову
zh: 贡献语言

source: Available
ru: Доступно
uk: в наявності
zh: 可用

# importSameAccount_1
source: The address of the account to be created is: <theme>{address}</theme>
ru: Адрес создаваемой учетной записи: <theme>{address}</theme>
uk: Адреса облікового запису, який буде створено: <theme>{address}</theme>
zh: 即将创建的账户地址为：<theme>{address}</theme>

# inputOldPwd
source: Please enter the <bold>old</bold> password
ru: Введите <bold>старый</bold> пароль
uk: Будь ласка, введіть <bold>старий</bold> пароль
zh: 请输入<bold>旧</bold>密码

# warningTip
source: You are interacting with an address or contract that has been flagged as scam. If you sign, you could lose access to all of your NFTs and any funds or other assets in your wallet.
ru: Вы взаимодействуете с адресом или контрактом, который был отмечен как мошеннический. Если вы подпишите, можете потерять доступ ко всем вашим NFT и любым средствам или другим активам в вашем кошельке.
uk: Ви маєте справу з адресою або контрактом, яка(який) помічено як scam. Якщо ви підпишите, ви можете втратити доступ до всіх ваших NFTs та інших коштів у вашому гаманці.
zh: 您正在与已被标记为诈骗的地址进行交互。 如果您签名，您可能无法访问您的所有 NFT 以及钱包中的任何资金或其他资产。

# ledgerNotSupportSign
source: Ledger doesn't support sign message
ru: Ledger не поддерживает сообщения с подписью
uk: Ledger не підтримує підписані повідомлення
zh: Ledger 不支持签名消息

source: Browser
ru: Браузер
uk: Браузер
zh: 浏览

source: Search or input URL
ru: Поиск или ввод URL-адреса
uk: Пошук або введення URL адреси
zh: 搜索或输入网址

# allowSiteAddNode
source: Allow this site to add a network
ru: Разрешить этому сайту добавить сеть
uk: Дозволити цьому сайту додати мережу
zh: 允许此网站添加网络

# removeFavorites
source: Remove from favorites
ru: Удалить из избранного
uk: Видалити із обраного
zh: 从收藏中删除

# addFavorites
source: Add to favorites
ru: Добавить в избранное
uk: Додати в обране
zh: 添加到收藏

source: Copy Link
ru: Копировать ссылку
uk: Копіювати посилання
zh: 复制链接

source: Open in browser
ru: Открыть в браузере
uk: Відкрити в браузері
zh: 从浏览器打开

source: Connection Request
ru: Запрос на подключение
uk: Запит на підключення
zh: 连接请求

# connectTip
source: This website would like to view account
ru: Этот сайт хочет просмотреть ваш счёт
uk: Цей сайт хоче переглядати ваш рахунок
zh: 这个网站请求查看账户

# trustedSitesTip
source: Make sure you only connect to trusted sites
ru: Убедитесь, что вы подключаетесь только к надежным сайтам
uk: Переконайтеся, що ви підключаєтеся лише до надійних сайтів
zh: 请确保只与您信任的网站进行连接

source: Signature Request
ru: Запрос на подпись
uk: Запит на підпис
zh: 签名请求

source: Content
ru: Содержание
uk: Зміст
zh: 内容

source: Transaction Fee
ru: Комиссия за транзакцию
uk: Комісія за транзакцію
zh: 交易费

source: Site suggested
ru: Предложенный сайт
uk: Запропонований сайт
zh: 网站建议

source: Raw data
ru: Необработанные данные
uk: Необроблені дані
zh: 原始数据

source: Show data
ru: Показать данные
uk: Показати дані
zh: 展示数据

source: WARNING
ru: ВНИМАНИЕ
uk: УВАГА
zh: 警告

source: Switch Network
ru: Переключить сеть
uk: Перемкнути мережу
zh: 切换网络

# allowSwitch
source: Allow this site to switch the network?
ru: Разрешить этому сайту переключать сеть?
uk: Дозволити цьому сайту змінювати мережу?
zh: 允许此网站切换网络？

source: Current
ru: Текущий
uk: Поточний
zh: 当前网络

source: Target
ru: Цель
uk: Мета
zh: 目标网络

source: Recently
ru: Недавно
uk: Нещодавно
zh: 最近访问

source: Favorites
ru: Избранные
uk: Обране
zh: 收藏

# browserEmptyTip
source: Your favorites and history will show up here
ru: Здесь будут отображаться ваши избранные и история
uk: Тут відображатимуться ваше обране та історія
zh: 您的收藏和历史纪录会显示在这里

source: Website Not Found
ru: Сайт не найден
uk: Сайт не знайдено
zh: 未找到网址

# notSupportNow
source: Not supported yet
ru: Пока не поддерживается
uk: Поки що не підтримується
zh: 暂不支持

source: New Fee
ru: Новая комиссия
uk: Нова комісія
zh: 新交易费

source: Show Testnet
ru: Показать Тестнеты
uk: Показати тестову мережу
zh: 显示测试网

source: Add Account
ru: Добавить аккаунт
uk: Додати акаунт
zh: 添加账户

source: Create Account
ru: Создать аккаунт
uk: Створити акаунт
zh: 创建账户

source: Hardware Wallet
ru: Аппаратный кошелёк
uk: Апаратний гаманець
zh: 硬件钱包

source: Ledger Connected
ru: Устройство Ledger подключено
uk: Пристрій Ledger підключено
zh: Ledger 已连接

source: Ledger not Connected
ru: Устройство Ledger не подключено
uk: Пристрій Ledger не підключено
zh: Ledger 未连接

# txType
source: Transaction Type
ru: Тип транзакции
uk: Тип транзакції
zh: 交易类型

# appConnection
source: App Connections
ru: Подключения приложений
uk: Підключення програми
zh: 已连接应用

source: No connected Apps
ru: Нет подключенных приложений
uk: Немає підключених програм
zh: 没有已连接的应用

# txHistoryTip
source: Unable to provide transaction history
ru: Невозможно предоставить историю транзакций
uk: Не вдалося надати історію транзакцій
zh: 无法提供交易记录

source: Asset Management
ru: Управление активами
uk: Управління активами
zh: 资产管理

# newTokenFound
source: {count} new tokens found
ru: Найдено {count} новых токенов
uk: Знайдено {count} нових токенів
zh: 发现了{count}个新代币

source: Ignore
ru: Игнорировать
uk: Ігнорувати
zh: 忽略

source: Balance
ru: Баланс
uk: Баланс
zh: 余额

# updateTokenInfo
source: Update your token information?
ru: Обновить информацию о токенах?
uk: Оновити інформацію про токен?
zh: 更新您的代币信息？

# noTxHistory
source: No transaction history
ru: История транзакций отсутствует
uk: Історія транзакцій відсутня
zh: 没有交易历史

# buildFailed
source: Packaging failed
ru: Сборка не удалась
uk: Пакування не вдалося
zh: 打包失败

source: App Access
ru: App Доступ
uk: App доступ
zh: App 访问

source: Transactions
ru: Транзакции
uk: Транзакції
zh: 交易

source: Unlock
ru: Разблокировать
uk: Розблокувати
zh: 解锁

source: Use Biometric Authentication
ru: Использовать биометрическую аутентификацию
uk: Використовувати біометричну автентифікацію
zh: 使用生物识别

source: Login with Password
ru: Войти с паролем
uk: Увійти за допомогою пароля
zh: 使用密码登录

# clickToVerification
source: Click to start verification
ru: Нажмите, чтобы начать проверку
uk: Натисніть, щоб розпочати перевірку
zh: 点击开始验证

source: Reset Wallet
ru: Сбросить кошелек
uk: Скинути гаманець
zh: 重置钱包

source: Biometric Auth
ru: Биометрическая аутентификация
uk: Біометрична автентифікація
zh: 生物识别认证

source: Tap to verify
ru: Нажмите, чтобы подтвердить
uk: Натисніть, щоб підтвердити
zh: 点击验证

# zkAppTipTitle
source: You are visiting a third-party zkApp
ru: Вы посещаете стороннее zkApp
uk: Ви відвідуєте сторонній zkApp
zh: 您正在访问第三方zkApp

# zkAppTipContent
source: You are a subiect to third-party zkApp‘s User Agreement when entering this zkApp.
ru: При входе в это zkApp вы подчиняетесь Пользовательскому соглашению стороннего zkApp.
uk: Входячи до цього zkApp, ви підпорядковуєтесь Угоді користувача стороннього zkApp.
zh: 进入此zkApp时，您需遵守第三方zkApp的用户协议。

source: Password Verification
ru: Проверка пароля
uk: Перевірка пароля
zh: 密码验证

# pwdVerificationTip
source: At least one option must be selected.
ru: Необходимо выбрать хотя бы один вариант.
uk: Необхідно вибрати щонайменше одну опцію.
zh: 至少选择一个选项。

source: Select Asset
ru: Выбрать актив
uk: Вибрати актив
zh: 选择资产

# tokenPendingTip
source: There are <light>{count}</light> pending transactions, cancel or confirm the current action.
ru: В настоящее время есть <light>{count}</light> активных транзакций, отменить или продолжить текущую операцию.
uk: Зараз є <light>{count}</light> транзакцій, що виконуються, скасувати чи продовжити поточну операцію.
zh: 当前有<light>{count}</light>笔正在进行的交易，取消或继续当前操作

# pendingTx
source: Pending Transaction
ru: Ожидаемая транзакция
uk: Очікувана транзакція
zh: 待处理的交易

source: SIGNED
ru: Подписано
uk: Підписано
zh: 已签名
