Repository: aurowallet/auro-wallet-mobile-app
Catalog: lib/l10n/app_*.arb
Languages: ru, uk, zh

# deleteConfirm
source: Type '{tag}' to erase current wallet permanently
ru: Введите '{tag}', чтобы навсегда стереть текущий кошелек
uk: Введіть «{tag}», щоб назавжди стерти поточний гаманець
zh: 请输入“{tag}”确定重置钱包

# inputNewPwd
source: Please enter the <bold>new</bold> password
ru: Введите <bold>новый</bold> пароль
uk: Будь ласка, введіть <bold>новий</bold> пароль
zh: 请输入<bold>新</bold>密码

# inputNewPwdRepeat
source: Re-enter the <bold>new</bold> password
ru: Повторно введите <bold>новый</bold> пароль
uk: Повторно введіть <bold>новий</bold> пароль
zh: 请重复输入<bold>新</bold>密码

# emptyDelegateDesc1
source: Delegating MINA to the Block Producer node can help you obtain rewards for producing blocks. The Block Producer will distribute the rewards according to your delegated proportion, and the percentage of rewards depends on the rate setting by the Block Producer.
ru: Делегирование MINA на узел Block Producer может помочь вам получить награды за производство блоков. Производитель блока будет распределять вознаграждение в соответствии с вашей делегированной пропорцией, и процент наград зависит от установления ставок производителем блока.
uk: Делегування MINA вузлу Виробника Блоків може допомогти вам отримати винагороду за створення блоків. Виробник Блоків розподілить винагороди відповідно до делегованої вами пропорції, а відсоток винагород залежить від ставки, встановленої виробником блоків.
zh: 将 MINA 委托给网络中的出块节点可以帮助您获得出块收益，出块节点将根据您的委托比重进行分配收益，收益百分比取决于出块节点的费率设置。

# emptyDelegateDesc2
source: Effective time of delegating and rewards distributing rules:
ru: Эффективное время делегирования и вознаграждения распределительных правил:
uk: Ефективний час делегування та правила розподілу винагород:
zh: 委托生效时间和奖励机制请访问:

# emptyDelegateDesc3
source: Staking Guide
ru: Руководство по стейкингу
uk: Керівництво по ставці
zh: 委托教程

# changeNode
source: Change
ru: Изменение
uk: Зміна
zh: 更改

# stakingProviderName
source: Block Producer
ru: Валидатор
uk: Виробник Блоків
zh: 出块节点

# goStake
source: Go to staking
ru: Перейти к стейкингу
uk: Перейти до ставки
zh: 前往委托

# epochEndTime
source: Current epoch end in
ru: Текущая эпоха заканчивается
uk: Поточна епоха закінчується в
zh: 当前 Epoch 剩余时间

# searchPlaceholder
source: Block Producer name or address
ru: Имя или адрес валидатора
uk: Назва або адреса виробника блоків
zh: 出块节点名称或地址

# inputNodeAddress
source: Please input node provider address
ru: Пожалуйста, введите адрес узла
uk: Введіть адресу постачальника вузла
zh: 请输入委托节点地址

# nodeProviders
source: Block Producer
ru: Валидатор
uk: Виробник блоків
zh: 出块节点

# providerAddress
source: BP Address
ru: BP Адрес
uk: Адреса BP
zh: 节点地址

# manualAdd
source: Input Block Producer address
ru: Входной адрес узла Валидатор
uk: Введіть адресу вузла Виробник блоків
zh: 输入出块节点地址

# deleteAccountTip
source: A deleted account can only be restored by the Mnemonic Phrase or Private Key. Please make sure you have backed up your Mnemonic Phrase and Private Key.
ru: Удаленную учетную запись можно восстановить только с помощью мнемонической фразы или приватного ключа. Убедитесь, что вы создали резервную копию мнемонической фразы и приватного ключа.
uk: Видалений обліковий запис можна відновити лише за допомогою мнемонічної фрази або закритого ключа. Переконайтеся, що ви створили резервну копію мнемонічної фрази та закритого ключа.
zh: 删除的账户只能通过助记词或者私钥恢复，请确认您已经备份好助记词或者私钥。

# isee
source: OK
ru: Ок
uk: в порядку
zh: 我知道了

# walletHomeTip
source: The Mina network charges a one-time account creation fee of 1 MINA for spam prevention. It will be automatically deducted from the first transaction received.
ru: Сеть Mina взимает единовременную комиссию за создание счета в размере 1 MINA для предотвращения спама. Она автоматически вычитается из первой полученной транзакции и не взимается кошельком.
uk: Мережа Mina стягує одноразову плату за створення облікового запису в розмірі 1 MINA для захисту від спаму. Його буде автоматично вираховано з першої отриманої транзакції.
zh: 为了防止垃圾信息， Mina 网络一次性收取 1 MINA 的帐户创建费，它将自动从收到的第一个交易中扣除。

# startHome
source: Start
ru: Начать
uk: Старт
zh: 开始

# walletName
source: Auro Wallet
ru: Auro Кошелёк
uk: Гаманець Auro

# improtRepeat
source: Do not import repeatedly
ru: Не импортируйте повторно
uk: Не імпортуйте повторно
zh: 请勿重复导入

# walletAbout
source: Auro Wallet is a non-custodial wallet developed by the community. It is simple, convenient, and fully open source. It currently supports all the functions of the Mina Protocol.
ru: Auro Wallet - это кошелек non-custodial, разработанный сообществом. Прост, удобный и полностью открытый. В настоящее время он поддерживает все функции протокола Mina.
uk: Гаманець Auro Wallet — це гаманець, розроблений спільнотою. Він простий, зручний і повністю відкритий. Наразі він підтримує всі функції протоколу Mina.
zh: Auro 钱包是一款由社区开发的非托管钱包。它简单，易用，并且完全开源。支持 Mina 的所有功能。

# copyTipContent
source: Copying the private key is risky, and the clipboard is easily monitored and stolen by third-party applications.
ru: Копирование приватного ключа может быть рискованным, поскольку буфер обмена легко отслеживается и может быть украден сторонними приложениями.
uk: Копіювання закритого ключа є ризикованим, а буфер обміну легко відслідковується та викрадається програмами сторонніх розробників.
zh: 复制私钥存在风险，剪切板容易被第三方应用监听并盗取。

# copyTipContent2
source: Please ensure that the system and network environment you are using is absolutely safe before performing this operation.
ru: Перед выполнением этой операции убедитесь в абсолютной безопасности используемой системы и сетевого окружения.
uk: Перш ніж виконувати цю операцію, переконайтеся, що система та мережеве середовище, які ви використовуєте, є абсолютно безпечними.
zh: 请确保您所使用的系统及网络环境绝对安全再执行些操作。

# goToExplorer
source: Check more transaction history
ru: Проверьте историю транзакций
uk: Перевірте більше історії транзакцій
zh: 去浏览器查看交易记录

source: Follow Us
ru: Следуйте за нами
uk: Слідуй за нами
zh: 关注我们

source: Create Password
ru: Создать пароль
uk: Створити пароль
zh: 创建密码

source: Epoch Info
ru: Информация об эпохе
uk: Інформація про епоху
zh: Epoch 信息

# emptyDelegateTitle
source: You have not yet delegated
ru: Вы еще не делегировали
uk: Ви ще не делегували
zh: 您还没有委托

# passwordError
source: Incorrect password
ru: Неверный пароль
uk: Невірний пароль
zh: 密码错误

source: Restore Wallet
ru: Восстановить кошелёк
uk: Відновити гаманець
zh: 恢复钱包

# createPasswordTip
source: The password will be used for identity verification purposes to send transactions in Auro Wallet. Auro Wallet won't store the password itself or retrieve it for you. Please keep your password safe.
ru: Пароль будет использоваться для проверки личности при отправке транзакций в Auro Wallet. Auro Wallet не хранит пароль и не извлекает его для вас. Пожалуйста, храните свой пароль в безопасности.
uk: Пароль використовуватиметься для перевірки особи для надсилання транзакцій у Auro Wallet. Auro Wallet не зберігатиме сам пароль і не відновлюватиме його для вас. Будь ласка, бережіть свій пароль.
zh: 密码将用于在 Auro 钱包中发送交易和身份验证。Auro 钱包不保存密码，也无法帮您找回。请妥善保管。

# atLeastOneLowercaseLetter
source: lowercase letter
ru: строчная буква
uk: мала літера
zh: 小写字母

# atLeastOneUppercaseLetter
source: uppercase letter
ru: заглавная буква
uk: прописна літера
zh: 大写字母

# passwordRequires
source: 8 characters
ru: 8 символов
uk: 8 символів
zh: 8个字符

# backTips_1
source: Backup your mnemonic phrase now!
ru: Создать резервную копию мнемонической фразы сейчас!
uk: Зробіть резервну копію вашої мнемонічної фрази зараз!
zh: 现在开始备份助记词！

# backTips_2
source: The Mnemonic phrase consists of 12 English words, which cannot be retrieved if they are lost. Make sure the mnemonic phrase is kept in a secure location.
ru: Мнемоническая фраза состоит из 12 английских слов, которые невозможно восстановить, если они утеряны. Убедитесь, что мнемоническая фраза хранится в надежном месте.
uk: Мнемонічна фраза складається з 12 англійських слів, які неможливо відновити, якщо вони загублені. Переконайтеся, що мнемонічна фраза зберігається в надійному місці.
zh: 助记词由12个英文单词组成，丢失无法找回。请确认保存好助记词，并将其放在安全的地方。

# show_seed_content
source: Please write down the following mnemonic phrase and keep it in a safe place.
ru: Пожалуйста, запишите следующую мнемоническую фразу и сохраните ее в надежном месте.
uk: Будь ласка, запишіть наведену нижче мнемонічну фразу та збережіть її в надійному місці.
zh: 请抄写以下助记词并将其保存在安全的地方。

# seed_error
source: Incorrect mnemonic phrase
ru: Неправильная мнемоническая фраза
uk: Неправильна мнемонічна фраза
zh: 助记词输入错误

# backup_success
source: Congrats, You have successfully created a wallet!
ru: Поздравляем, вы успешно создали кошелек!
uk: Вітаємо! Ви успішно створили гаманець!
zh: 恭喜您，已经成功创建钱包！

# inputSeed
source: Please enter 12 mnemonic phrases in order, without capitalization, punctuation symbols.
ru: Пожалуйста, введите 12 мнемонических фраз по порядку, без заглавных букв и знаков препинания.
uk: Будь ласка, введіть по порядку 12 мнемонічних фраз, без великих літер, розділових знаків.
zh: 请按顺序输入12位助记词，没有大写和标点符号。

source: HISTORY
ru: ИСТОРИЯ
uk: ІСТОРІЯ
zh: 交易记录

# stakingStatus_1
source: Delegated
ru: Делегировано
uk: Делегований
zh: 已委托

source: Receive
ru: Получить
uk: Отримати
zh: 接收

source: Amount
ru: Сумма
uk: Сума
zh: 金额

# fromAddress
source: From
ru: От
uk: Від
zh: 发送

# memo
source: Memo(Optional)
ru: Memo(Опционально)
uk: Пам'ятка (необов'язково)
zh: 备注(选填)

# memo2
source: Memo
ru: Мемо
uk: Пам'ятка
zh: 备注

# fee_slow
source: Slow
ru: Медленно
uk: Повільно
zh: 慢

# fee_fast
source: Fast
ru: Быстро
uk: Швидко
zh: 快

# sendDetail
source: Transaction Overview
ru: Детали транзакции
uk: Деталі транзакції
zh: 交易详情

# amountError
source: Please enter a valid amount
ru: Пожалуйста, введите корректную сумму
uk: Введіть дійсну суму
zh: 输入的金额格式有误

# balanceNotEnough
source: Insufficient Balance
ru: Недостаточный Баланс
uk: Недостатній баланс
zh: 账户余额不足

# txHash
source: Transaction Hash
ru: Хэш транзакции
uk: Хеш транзакції
zh: 交易哈希

source: Time
ru: Время
uk: час
zh: 时间

source: Account Address
ru: Адрес Счёта
uk: Адреса рахунку
zh: 账户地址

source: Export Private Key
ru: Экспорт приватного ключа
uk: Експорт закритого ключа
zh: 导出私钥

# privateKeyTip_1
source: The private key consists of a string of characters, and owning the private key is equivalent to owning the asset ownership.
ru: Приватный ключ состоит из строки символов, владение закрытым ключом равносильно владению активом.
uk: Закритий ключ складається з рядка символів, і володіння закритим ключем еквівалентно володінню правом власності на актив.
zh: 私钥由一串字符组成，拥有私钥等于拥有账户资产所有权。

# copySuccess
source: Copied
ru: Скопировано
uk: Скопійовано
zh: 已复制

source: Import
ru: Импортировать
uk: Імпорт
zh: 导入

source: Account Name
ru: Название счёта
uk: Ім'я облікового запису
zh: 账户名称

# importAccount_2
source: The imported accounts will not be associated with your originally created Auro wallet.
ru: Импортированные учетные записи не будут связаны с вашим первоначально созданным в Auro Wallet.
uk: Імпортовані облікові записи не будуть пов’язані з вашим початково створеним гаманцем Auro.
zh: 导入的账号不会与最初创建的 Auro Wallet进行关联。

source: Copy to Clipboard
ru: Копировать в буфер обмена
uk: Копіювати в буфер обміну
zh: 复制到剪切板

# rootTip
source: Detected that the system has been Root or using the simulator. Continue to use there will be risks!
ru: Обнаружено, что система была рутирована или используется симулятор. Дальнейшее использование будет сопряжено с риском!
uk: Виявлено, що система була рутована або використовувала симулятор. Подальше використання, це буде ризик!
zh: 检测到系统已经 Root 或者使用模拟器. 继续使用将存在风险！

# backupInOrder
source: To ensure you have backed up the Mnemonic Phrase, please tap the 12 words in order.
ru: Чтобы убедиться, что вы сохранили мнемоническую фразу, введите 12 слов по порядку.
uk: Щоб переконатися, що ви зробили резервну копію мнемонічної фрази, торкніться 12 слів по порядку.
zh: 为了确保您已经成功备份助记词，请按顺序选择12个单词。

source: Name
ru: Имя
uk: Ім'я
zh: 名称

# privacy
source: Privacy Policy
ru: Политика конфиденциальности
uk: Політика конфіденційності
zh: 隐私协议

source: Address
ru: Адрес
uk: Адреса
zh: 地址

source: Reset
ru: Сброс
uk: Скинути
zh: 重置

# resetWarnContentTitle
source: Are you sure you want to reset your wallet?
ru: Вы уверены, что хотите сбросить кошелёк?
uk: Ви впевнені, що бажаєте скинути налаштування гаманця?
zh: 确定要重置钱包吗？

# repeatContact
source: Address exists
ru: Адрес существует
uk: Адреса існує
zh: 地址已存在

# cancelReset
source: Cancel
ru: Отменить
uk: Скасувати
zh: 取消

# watchModeWarn2
source: Auro Wallet no longer support the [Watch Account] , you need to <red>delete all watch accounts</red> before you can continue to use.
ru: Auro Wallet больше не поддерживает [Наблюдение за счётом] . Вам необходимо <red>удалить все наблюдаемые счета</red>, прежде чем вы сможете продолжить использовать Auro Wallet.
uk: Auro Wallet більше не підтримує [Обліковий запис годинника], вам потрібно <red>видалити всі облікові записи годинника</red>, перш ніж ви зможете продовжити використання.
zh: Auro Wallet 已经不再支持【观察钱包】功能，您需要<red>删除所有观察钱包</red>之后才可以继续使用。

# mnemonicLost
source: If mnemonic phrase lost, my funds will be lost forever.
ru: Если мнемоническая фраза будет утеряна, мои средства будут потеряны навсегда.
uk: Якщо мнемонічна фраза втрачена, мої кошти будуть втрачені назавжди.
zh: 如果助记词丢失，我的资产将永久丢失。

# protectMnemonic
source: I take full responsibility for protecting the mnemonic.
ru: Я беру на себя полную ответственность за защиту мнемонической фразы.
uk: Я беру на себе повну відповідальність за захист мнемонічної фрази.
zh: 我对助记词的安全保存负全部责任。

# emptyAddress
source: No addresses saved
ru: Адреса не сохранены
uk: Немає збережених адрес
zh: 没有保存的地址

source: scam
ru: скам
uk: афера
zh: 风险

# hdDerivedPath
source: HD Path
ru: Путь HD
uk: Шлях HD
zh: HD 路径

# speedUpTitle
source: Speed Up Transaction
ru: Ускорить транзакцию
uk: Прискорити транзакцію
zh: 加速交易

# renameAccountName
source: Change Account Name
ru: Изменить имя счета
uk: Змінити назву облікового запису
zh: 更改账户名

source: Cancel Transaction
ru: Отменить транзакцию
uk: Скасувати транзакцію
zh: 取消交易

# speedUpTip
source: Normally, a transaction takes <light>3 minutes</light> to confirm. However, when the network is congested and your transaction may take longer than 3 minutes or more, you can speed up the transaction process by increasing the transaction fee.
ru: Обычно подтверждение транзакции занимает <light>3 минуты</light>. Однако если сеть перегружена, ваша транзакция может занять 3 минуты и более, вы можете ускорить процесс, увеличив комиссию за транзакцию.
uk: Зазвичай для підтвердження транзакції потрібно <light>3 хвилини</light>. Однак, якщо мережа перевантажена і ваша транзакція може тривати довше, ніж 3 хвилини або більше, ви можете пришвидшити процес транзакції, збільшивши комісію за транзакцію.
zh: 通常情况下，一笔交易需要<light>3分钟</light>才能确认。 但是，当网络拥堵时，您的交易可能需要花费大于3分钟或者更久的时间，您可以通过提高交易费用来加快交易过程。

# transactionCancelTip
source: Cancel the transaction by sending a transaction with the same Nonce to yourself address. The fee will be greater than the current transaction fee (+0.0001 MINA) .
ru: Отмените транзакцию, отправив транзакцию с тем же Nonce на свой адрес. Комиссия будет больше, чем текущая комиссия за транзакцию (+0,0001 MINA).
uk: Скасуйте транзакцію, надіславши транзакцію з тим самим Nonce на свою адресу. Комісія буде більшою, ніж поточна комісія за транзакцію (0,0001 MINA).
zh: 通过给自己的地址发送一笔相同 Nonce 的交易来取消之前的交易。 该费用将高于当前的交易费用（+0.0001 MINA）。

source: Current Fee
ru: Текущая комиссия
uk: Поточна комісія
zh: 当前交易费

source: Add Address
ru: Добавить адрес
uk: Додати адресу
zh: 添加地址

source: Delete Address?
ru: Удалить адрес?
uk: Видалити адресу?
zh: 删除地址？

source: Add Network
ru: Добавить сеть
uk: Додати мережу
zh: 添加网络

source: Edit Network
ru: Изменить сеть
uk: Редагувати мережу
zh: 编辑节点

# nodeAddress
source: Node URL
ru: URL-адрес узла
uk: URL вузла
zh: 节点地址

# submitNode
source: Submit/Update your node to this list
ru: Добавить/Обновить свой узел в этот список
uk: Надішліть/оновіть свій вузол до цього списку
zh: 提交/更新节点到这个列表

# ledgerTip1
source: Connect your Ledger to the phone.
ru: Подключите устройство Ledger к телефону.
uk: Підключіть Ledger до телефону.
zh: 将 Ledger 与手机连接。

# ledgerTip2
source: Open the Mina app in your Ledger device, Until you see <bold>Mina is ready</bold>.
ru: Откройте приложение Mina на своем устройстве Ledger, пока не увидите <bold>Mina is ready</bold>.
uk: Відкрийте програму Mina на своєму пристрої Ledger, доки не побачите <bold>Mina готова</bold>.
zh: 在 Ledger 中打开 Mina 应用，直到看到 <bold>Mina is ready</bold>。

source: Ledger Status
ru: Состояние Ledger
uk: Статус Ledger
zh: Ledger 状态

# ledgerAddressTip1
source: Please continue the follow-up operation according to the prompt of the Ledger hardware wallet.
ru: Пожалуйста, продолжайте последующую операцию в соответствии с подсказками аппаратного кошелька Ledger.
uk: Продовжуйте подальшу операцію згідно з підказкою апаратного гаманця Ledger.
zh: 请根据 Ledger 硬件钱包中的提示进行以下操作。

# ledgerAddressTip3
source: <lightred>Do not close this window.</lightred> Once the Ledger is complete, the page will redirect automatically.
ru: <lightred>Не закрывайте это окно.</lightred> После завершения работы с Ledger, страница автоматически перенаправится.
uk: <lightred>Не закривайте це вікно.</lightred> Щойно Ledger буде завершено, сторінка буде автоматично переспрямована.
zh: <lightred>不要关闭本窗口。</lightred>Ledger 完成后，页面将自动跳转。

# waitingLedger
source: Waiting for confirmation…
ru: Ожидание подтверждения…
uk: Очікування підтвердження…
zh: 等待确认…

# waitingLedgerSign
source: Please confirm in the Ledger hardware wallet, the signature may take 1-3 minutes.
ru: Пожалуйста, подтвердите в аппаратном кошельке Ledger, подпись может занять 1-3 минуты.
uk: Підтвердьте в апаратному гаманці Ledger, підпис може зайняти 1-3 хвилини.
zh: 请在 Ledger 硬件钱包中进行确认，签名可能会需要1-3分钟的时间。

# openMinaApp
source: Ledger device is connected, but Mina app is not open. Please open Mina app in Ledger.
ru: Устройство Ledger подключено, но приложение Mina не открыто. Пожалуйста, откройте приложение Mina в устройстве Ledger.
uk: Пристрій Ledger підключено, але додаток Mina не відкрито. Відкрийте додаток Mina в Ledger.
zh: Ledger 已连接，但是 Mina 应用没有打开，请在 Ledger 中打开 Mina 应用。

# unlockLedger
source: Failed to connect. Please make sure your Ledger device is unlocked.
ru: Не удалось подключиться. Пожалуйста, убедитесь, что устройство Ledger разблокировано.
uk: Не вдалося підключитися. Переконайтеся, що ваш пристрій Ledger розблоковано.
zh: 连接失败，请确保您的 Ledger 设备处于解锁状态。

# ledgerSearching
source: Searching…
ru: Поиск…
uk: Пошук…
zh: 搜索…

# ledgerSupport
source: (<lightred>Only support Ledger Nano X</lightred>)
ru: (<lightred>Поддерживает только Ledger Nano X</lightred>)
uk: (<lightred>підтримує лише Ledger Nano X</lightred>)
zh: (<lightred>仅支持 Ledger Nano X</lightred>)

# termsAndPrivacy_line1
source: This service is provided by Auro Wallet, please take time to read carefully and understand the Terms and Conditions and Privacy Policy.
ru: Эта услуга предоставляется компанией Auro Wallet, пожалуйста, уделите время тому, чтобы внимательно прочитать и понять Правила и условия и Политику конфиденциальности.
uk: Цю послугу надає Auro Wallet. Будь ласка, знайдіть час, щоб уважно прочитати та зрозуміти Умови та Політику конфіденційності.
zh: 使用 Auro 钱包提供的服务，您需要阅读并充分理解使用条款和隐私政策相关的内容。

# termsAndPrivacy_line2
source: Please read the <conditions>Terms and Conditions</conditions> and <policy>Privacy Policy</policy> carefully. If you understand fully and agree, please click [Agree] to start using this wallet service.
ru: Пожалуйста, внимательно прочитайте <conditions>Сроки и условия</conditions> и <policy>Политику конфиденциальности</policy>. Если вы все поняли и согласны, пожалуйста, нажмите [Принять], чтобы начать пользоваться кошельком.
uk: Уважно прочитайте <conditions>Загальні положення та умови</conditions> та <policy>Політику конфіденційності</policy>. Якщо ви повністю розумієте та погоджуєтеся, натисніть [Agree], щоб почати користуватися цією послугою гаманця.
zh: 您可以阅读<conditions>《使用条款》</conditions>和<policy>《隐私政策》</policy>了解详细信息，如果您同意，请点击【同意】开始使用钱包服务。

# importSameAccount_2
source: An existing imported account [{accountName}] is a duplicate of this address. Auro Wallet does not support the creation of duplicate account addresses. Please go to the <acmanage>Account Management</acmanage> to delete the imported account.
ru: Существующий импортированный счет [{accountName}] является дубликатом этого адреса. Auro Wallet не поддерживает дублирование адресов счетов. Пожалуйста, перейдите в раздел <acmanage>Управление счетом</acmanage>, чтобы удалить импортированный счет.
uk: Існуючий імпортований обліковий запис [{accountName}] є дублікатом цієї адреси. Auro Wallet не підтримує створення дублікатів адрес облікових записів. Перейдіть до <acmanage>Керування обліковим записом</acmanage>, щоб видалити імпортований обліковий запис.
zh: 已存在导入账户【{accountName}】与此地址重复，Auro 钱包不支持账户地址重复创建，请前往<acmanage>账户管理页</acmanage>将已导入的账户删除。

# resetWarnContent
source: After resetting you existing wallet all the data will be lost. You can only use the mnemonic phrase to restore. Please ensure you have backed-up the mnemonic phrase before you reset the wallet.
ru: После сброса существующего кошелька все данные будут потеряны. Для восстановления можно использовать только мнемоническую фразу. Пожалуйста, убедитесь, что вы сделали резервную копию мнемонической фразы перед сбросом кошелька.
uk: Після скидання наявного гаманця всі дані буде втрачено. Для відновлення можна використовувати лише мнемографічну фразу. Будь ласка, переконайтеся, що ви створили резервну копію мнемонічної фрази перед скиданням гаманця.
zh: 重置后，现有钱包的数据将会全部丢失，只能使用助记词恢复。请确保您已经备份好助记词后再重置钱包。

source: Loading
ru: Загрузить
uk: Завантаження
zh: 加载中

# keystoreError
source: Keystore contents or password is incorrect
ru: Содержимое хранилища ключей или пароль неверны
uk: Вміст сховища ключів або пароль неправильні
zh: Keystore 内容错误或密码不正确

# pleaseInputKeyPair
source: Please enter the contents of the Keystore file.
ru: Введите содержимое файла Keystore.
uk: Будь ласка, введіть вміст файлу Keystore.
zh: 请将 Keystore 文件的内容输入在下方。

# pleaseInputKeyPairPwd
source: Keystore Password
ru: Пароль хранилища ключей
uk: Пароль сховища ключів
zh: 输入 Keystore 密码

# pleaseInputPriKey
source: Please enter Private Key.
ru: Пожалуйста, введите приватный ключ.
uk: Введіть закритий ключ.
zh: 请输入私钥。

source: FAILED
ru: НЕ УДАЛОСЬ
uk: ПОМИЛКА
zh: 失败

source: Agree
ru: Принять
uk: Погодьтеся
zh: 同意

source: Watch Mode
ru: Режим просмотра
uk: Режим перегляду
zh: 观察模式

source: Watch Account
ru: Наблюдаемый счёт
uk: Спостерігати за рахунком
zh: 观察账户

# watchLabel
source: Watch
ru: Наблюдать
uk: Дивитися
zh: 观察

source: Create Wallet
ru: Создать кошелёк
uk: Створити гаманець
zh: 创建钱包

# inputPassword
source: Enter password
ru: Введите пароль
uk: Введіть пароль
zh: 输入密码

source: Next
ru: Далее
uk: Далі
zh: 下一步

# atLeastOneNumber
source: number
ru: цифра
uk: номер
zh: 数字

# passwordDifferent
source: Passwords do not match
ru: Пароли не совпадают
uk: Паролі не збігаються
zh: 密码不匹配

# backTips_3
source: If the wallet cannot be accessed because the device is lost or for any other reason, importing the mnemonic phrase is the only way to retrieve your assets.
ru: Если доступ к кошельку невозможен из-за потери устройства или по какой-либо другой причине, импорт мнемонической фразы - единственный способ вернуть свои активы.
uk: Якщо до гаманця неможливо отримати доступ через втрату пристрою або з будь-якої іншої причини, імпортування мнемонічної фрази є єдиним способом відновити ваші активи.
zh: 当发生设备丢失或者其它原因无法访问钱包时，使用助记词是找回资产的唯一方法。

# show_seed_button
source: Confirmed Backup
ru: Резервное копирование подтверждено
uk: Підтверджена резервна копія
zh: 我已保存
